Revit 2027 API
NumberingSchema.GetMatchingParameters Method
 Returns the parameters used for matching elements in this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<NumberingParameter> GetMatchingParameters()
Public Function GetMatchingParameters As ICollection(Of NumberingParameter)
public:
ICollection<NumberingParameter^>^ GetMatchingParameters()
member GetMatchingParameters : unit -> ICollection<NumberingParameter>
Return Value
ICollection<NumberingParameter>
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace